Documents/ТребованиеНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТребованиеНакладная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СубконтоСписанияНДС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособУчетаМатериаловПоСотруднику</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаМатериаловПоСотрудникам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦельРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасходаМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДСвСтоимостиТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействиеНДСВСтоимостиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СубконтоСписанияНДС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДляСписанияНДСиспользоватьСчетИАналитикуУчетаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетСписанияНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СубконтоСписанияНДС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОтражениеВУСН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОприходования</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МатериалыЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СчетПередачи</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТребованиеНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	
	//Команды
	КомандаФормы = Команды.Добавить("Заполнить");  
	КомандаФормы.Заголовок = "Заполнить";
	КомандаФормы.Действие  = "Заполнить";  
	
	//Элементы формы
	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ОбъектОтправитель", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.Склад);
	ПолеВвода_АЛФ.Заголовок = "Объект";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ОбъектОтправитель"; 
	
 	ПолеВвода_АЛФ = Элементы.Вставить("МОЛСписания", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.АналитикаУчетаЗатрат);
	ПолеВвода_АЛФ.Заголовок = "МОЛ";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.МОЛСписания"; 

 	ПолеВвода_АЛФ = Элементы.Вставить("ИИТ_ВидНоменклатуры", Тип("ПолеФормы"), Элементы.ГруппаШапкаПравая, Элементы.АналитикаУчетаЗатрат);
	ПолеВвода_АЛФ.Заголовок = "Вид номенклатуры";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.ИИТ_ВидНоменклатуры";
	
	КнопкаКоманднойПанели = Элементы.Добавить("МатериалыЗаполнить", Тип("КнопкаФормы"), Элементы.МатериалыКоманднаяПанель);
	КнопкаКоманднойПанели.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаКоманднойПанели.Заголовок = "Заполнить";
	КнопкаКоманднойПанели.ИмяКоманды  = "Заполнить";
	
	Элементы.МатериалыНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	Элементы.МатериалыГруппаНоменклатура.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	
	МатериалыГруппа1 = Элементы.Вставить("МатериалыГруппа1", Тип("ГруппаФормы"), Элементы.МатериалыГруппаНоменклатураСКартинкой, Элементы.МатериалыПрослеживаемыйТовар); 
	МатериалыГруппа1.Вид = ВидГруппыФормы.ГруппаКолонок;
	МатериалыГруппа1.Группировка = ГруппировкаКолонок.Вертикальная;
	МатериалыГруппа1.ОтображатьВШапке = Ложь; 
	
	Элементы.Переместить(Элементы.МатериалыНоменклатура, МатериалыГруппа1);
	
	ЭлементТаблицыФормы = Элементы.Добавить("ТоварыНоменклатураВидНоменклатуры", Тип("ПолеФормы"), МатериалыГруппа1);
	ЭлементТаблицыФормы.Заголовок = "Бухгалтерская номенклатура"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.НоменклатураБухгалтерская";

	МатериалыГруппа3 = Элементы.Вставить("МатериалыГруппа3", Тип("ГруппаФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест); 
	МатериалыГруппа3.Вид = ВидГруппыФормы.ГруппаКолонок;
	МатериалыГруппа3.Группировка = ГруппировкаКолонок.Вертикальная;
	МатериалыГруппа3.ОтображатьВШапке = Ложь;  
	
	ПолеВвода_АЛФ = Элементы.Добавить("МатериалыИнвентарныйНомер", Тип("ПолеФормы"), МатериалыГруппа3);
	ПолеВвода_АЛФ.Заголовок = "Инвентарный номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.Материалы.ИнвентарныйНомер"; 

	ПолеВвода_АЛФ = Элементы.Вставить("МатериалыСерийныйНомер", Тип("ПолеФормы"), МатериалыГруппа3);
	ПолеВвода_АЛФ.Заголовок = "Серийный номер";
	ПолеВвода_АЛФ.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_АЛФ.ПутьКДанным = "Объект.Материалы.СерийныйНомер"; 
	
 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыПризнакСписания", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест);
	ЭлементТаблицыФормы.Заголовок = "Признак списания"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.ПризнакСписания";

 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыУХ_Характеристика", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест);
	ЭлементТаблицыФормы.Заголовок = "Характеристика"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.УХ_Характеристика";
	ЭлементТаблицыФормы.Видимость = Ложь;
	
	МатериалыГруппа2 = Элементы.Вставить("МатериалыГруппа2", Тип("ГруппаФормы"), Элементы.Материалы, Элементы.МатериалыКоличествоМест); 
	МатериалыГруппа2.Вид = ВидГруппыФормы.ГруппаКолонок;
	МатериалыГруппа2.Группировка = ГруппировкаКолонок.Вертикальная;
	МатериалыГруппа2.ОтображатьВШапке = Ложь;  
	
	//Для элемента путь установлен на форме, иначе элемент не существует
	Элементы.МатериалыНоменклатураЕдиницаИзмерения.Заголовок = "Ед. изм.";
	Элементы.МатериалыНоменклатураЕдиницаИзмерения.ОтображатьВШапке = Истина;
	Элементы.Переместить(Элементы.МатериалыНоменклатураЕдиницаИзмерения, МатериалыГруппа2);

 	ЭлементТаблицыФормы = Элементы.Добавить("МатериалыЕдиницаИзмеренияБухаглтерская", Тип("ПолеФормы"), Элементы.МатериалыГруппа2);
	ЭлементТаблицыФормы.Заголовок = "Ед. изм. бух."; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.ЕдиницаИзмеренияБухаглтерская";
	ЭлементТаблицыФормы.Видимость = Ложь;

 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыСуммаСписания", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыСчет);
	ЭлементТаблицыФормы.Заголовок = "Сумма списания"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.СуммаСписания";
	
 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыПолностью", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыСчет);
	ЭлементТаблицыФормы.Заголовок = "Забрать все"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.Полностью";
    ЭлементТаблицыФормы.ШрифтЗаголовка = Новый Шрифт(ЭлементТаблицыФормы.ШрифтЗаголовка,,,Истина);

 	ЭлементТаблицыФормы = Элементы.Вставить("МатериалыКоличествоВсего", Тип("ПолеФормы"), Элементы.Материалы, Элементы.МатериалыСчет);
	ЭлементТаблицыФормы.Заголовок = "Количество всего"; 
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.Материалы.КоличествоВсего";
    ЭлементТаблицыФормы.ШрифтЗаголовка = Новый Шрифт(ЭлементТаблицыФормы.ШрифтЗаголовка,,,Истина);

КонецПроцедуры

#Область Перенос_доработок

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИИТ_ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ИИТ_ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоВсего,
	|	ИИТ_ОстаткиТМЦОстатки.СуммаОстаток КАК СуммаСписания,
	|	ИИТ_ОстаткиТМЦОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Коэффициент,
	|	&Счет КАК Счет,
	|	&Счет КАК СчетУчета,
	|	&Счет КАК НовыйСчетУчета,
	|	"""" КАК ИнвентарныйНомер,
	|	"""" КАК СерийныйНомер,
	|	ИИТ_ОстаткиТМЦОстатки.БухгалтерскаяНоменклатура КАК БухгалтерскаяНоменклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ИИТ_ОстаткиТМЦ.Остатки(
	|			&Дата,
	|			МОЛ = &МОЛ
	|				И Склад = &Склад
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ИИТ_ОстаткиТМЦОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.ОсновноеСредство,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.КоличествоОстаток,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.СтоимостьОстаток,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.ОсновноеСредство.ЕдиницаИзмерения,
	|	1,
	|	&Счет,
	|	&Счет,
	|	&Счет,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.ИнвентарныйНомер,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.СерийныйНомер,
	|	ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки.БухгалтерскаяНоменклатура
	|ИЗ
	|	РегистрНакопления.ИИТ_ОстаткиОсновныхСредствИИнструмента.Остатки(
	|			&Дата,
	|			МОЛ = &МОЛ
	|				И Склад = &Склад
	|				И ОсновноеСредство.ВидНоменклатуры = &ВидНоменклатуры) КАК ИИТ_ОстаткиОсновныхСредствИИнструментаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.КоличествоВсего КАК КоличествоВсего,
	|	ВТ.СуммаСписания КАК СуммаСписания,
	|	ВТ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.Коэффициент КАК Коэффициент,
	|	ВТ.СчетУчета КАК СчетУчета,
	|	ВТ.НовыйСчетУчета КАК НовыйСчетУчета,
	|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ.СерийныйНомер КАК СерийныйНомер,
	|	ВТ.БухгалтерскаяНоменклатура КАК БухгалтерскаяНоменклатура,
	|	ВТ.Счет КАК Счет
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.КоличествоВсего <> 0";
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("МОЛ", Объект.МОЛСписания);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Хозрасчетный.НайтиПоКоду("41.01"));
	Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.ИИТ_ВидНоменклатуры);
	
	Объект.Материалы.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура МатериалыПолностьюПриИзменении(Элемент)
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекСтрока.Количество = ТекСтрока.КоличествоВсего;
КонецПроцедуры

#КонецОбласти
